TexasInstruments/c2000ware-core-sdk/driverlib/f28003x/examples/dsp/dsp_fpu_rfft_adc_fpu32_f28003x.c
//#############################################################################
//
// FILE:   empty_sysconfig_main.c
//
// TITLE:  Empty Pinmux Example
//
// Empty SysCfg & Driverlib Example
//
// This example is an empty project setup for SysConfig and Driverlib
// development.
//
//#############################################################################
//
//
// $Copyright:
// Copyright (C) 2026 Texas Instruments Incorporated - http://www.ti.com/
//
// Redistribution and use in source and binary forms, with or without 
// modification, are permitted provided that the following conditions 
// are met:
// 
//   Redistributions of source code must retain the above copyright 
//   notice, this list of conditions and the following disclaimer.
// 
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the 
//   documentation and/or other materials provided with the   
//   distribution.
// 
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
// 
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
// $
//#############################################################################


//
// Included Files
//
#include "driverlib.h"
#include "device.h"
#include "board.h"
#include "c2000ware_libraries.h"

uint16_t test_input[512] = {
     46,      83,      68,      35,
         42,      73,      77,      53,
         37,      37,      38,      40,
         43,      32,      13,      23,
         60,      71,      40,      24,
         59,      93,      72,      33,
         35,      62,      62,      37,
         22,      25,      31,      39,
         48,      42,      27,      38,
         75,      84,      49,      28,
         58,      86,      60,      18,
         19,      47,      51,      30,
         21,      30,      41,      52,
         63,      57,      40,      48,
         79,      83,      42,      17,
         43,      70,      46,       7,
         12,      46,      55,      39,
         34,      45,      56,      65,
         73,      62,      39,      41,
         68,      68,      26,       2,
         32,      63,      44,      11,
         22,      59,      70,      55,
         48,      55,      60,      64,
         66,      50,      24,      25,
         53,      56,      19,       0,
         36,      73,      58,      27,
         37,      72,      80,      59,
         46,      48,      49,      49,
         50,      35,      12,      18,
         52,      61,      29,      14,
         51,      88,      71,      36,
         41,      71,      73,      47,
         31,      32,      34,      38,
         43,      34,      17,      28,
         65,      76,      44,      27,
         61,      92,      70,      29,
         30,      56,      57,      33,
         20,      25,      33,      42,
         52,      47,      32,      43,
         78,      86,      49,      26,
         54,      81,      55,      13,
         15,      45,      50,      31,
         24,      35,      46,      57,
         68,      61,      42,      47,
         77,      79,      37,      11,
         38,      66,      43,       6,
         13,      49,      60,      45,
         40,      50,      59,      67,
         72,      59,      35,      36,
         62,      63,      22,       0,
         31,      65,      48,      16,
         27,      64,      75,      58,
         49,      54,      58,      60,
         60,      44,      19,      21,
         51,      56,      21,       4,
         41,      78,      63,      31,
         40,      74,      79,      57,
         42,      43,      43,      44,
         46,      33,      12,      20,
         55,      65,      34,      19,
         56,      91,      73,      36,
         39,      67,      68,      42,
         26,      28,      32,      37,
         44,      37,      22,      33,
};

const float test_golden[514] = {
       2.873748473748F,    0.000055087470F,   -0.000200581179F,    0.000653881035F,
       0.000251828052F,    0.000293578167F,   -0.000038960524F,    0.000018333666F,
       0.000398094781F,    0.001312699062F,    0.000648477391F,    0.000658156773F,
       0.001446936416F,    0.002310737583F,    0.004648047813F,    0.085540948231F,
      -0.005857335245F,   -0.002808582850F,   -0.002799189481F,   -0.001239503075F,
      -0.001208490265F,   -0.000012829133F,   -0.000556231024F,   -0.000398132224F,
      -0.001010989006F,   -0.000403827939F,   -0.000004174950F,    0.000487349757F,
       0.000169608839F,    0.000035532113F,   -0.000390025417F,    0.001037324575F,
       0.001226084318F,    0.002697436353F,    0.000714686554F,    0.001327692119F,
       0.000910917155F,    0.002242345872F,    0.002285039305F,    0.003063856794F,
       0.003522875135F,    0.004093571352F,    0.004295703922F,    0.005451436590F,
       0.006905211469F,    0.009022053084F,    0.010319144425F,    0.013282720331F,
       0.018790847174F,    0.028507018575F,    0.054578800681F,    0.341441034017F,
      -0.089533183074F,   -0.041581462757F,   -0.029787221486F,   -0.020454237177F,
      -0.017322906405F,   -0.014805098477F,   -0.012984574084F,   -0.011976404265F,
      -0.013219146333F,   -0.009494440213F,   -0.009057438767F,   -0.009091269145F,
      -0.008058608059F,   -0.008221291335F,   -0.008771369734F,   -0.006731757252F,
      -0.007012271857F,   -0.008901624139F,   -0.005907496297F,   -0.006072742081F,
      -0.007209048812F,   -0.004987329773F,   -0.005446932107F,   -0.004700121485F,
      -0.005450434922F,   -0.005254019744F,   -0.005269367841F,   -0.005646287364F,
      -0.005297603219F,   -0.005841847751F,   -0.004431726042F,   -0.004770803186F,
      -0.003773055218F,   -0.005111314209F,   -0.004774702103F,   -0.004525349367F,
      -0.005490755474F,   -0.005024434376F,   -0.005294394133F,   -0.004536392700F,
      -0.005041804633F,   -0.005622015601F,   -0.003723823808F,   -0.004154198900F,
      -0.004644887736F,   -0.004380976548F,   -0.004064254997F,   -0.003417352326F,
      -0.004909318250F,   -0.004853213626F,   -0.004647343412F,   -0.004324672328F,
      -0.004529107701F,   -0.005551048825F,   -0.003855218540F,   -0.004013596148F,
      -0.004090067101F,   -0.004254356530F,   -0.004694635065F,   -0.005453978475F,
      -0.002751903826F,   -0.003462597045F,   -0.003635499225F,   -0.004414425141F,
      -0.003873108267F,   -0.003335053990F,   -0.004827410681F,   -0.004851036293F,
      -0.005476599636F,   -0.002614510600F,   -0.003422765059F,   -0.003619041239F,
      -0.004418554856F,   -0.003881158762F,   -0.003605418838F,   -0.004306224693F,
      -0.004395604396F,    0.000453364735F,   -0.000019072334F,   -0.000080367764F,
       0.000330313699F,   -0.000279493250F,    0.000053309461F,   -0.000601877270F,
       0.000817259868F,    0.000525775843F,    0.000400490377F,    0.001411602706F,
       0.000802975309F,    0.001157470854F,    0.000324369455F,    0.000808299065F,
       0.000478693061F,    0.001009559687F,    0.001147895425F,    0.001625982482F,
       0.000642594964F,    0.000750691648F,    0.000979289615F,    0.001101907795F,
       0.001228712935F,    0.000680879887F,    0.001896940971F,    0.001627978709F,
       0.001637790381F,    0.002366455307F,    0.001804983878F,    0.002105204893F,
       0.001435575008F,    0.001916367374F,    0.001487985909F,    0.002727833519F,
       0.002558316427F,    0.003004274547F,    0.001881693611F,    0.002199887957F,
       0.002641672032F,    0.002040020836F,    0.002642339041F,    0.002441273439F,
       0.002699727206F,    0.002852482226F,    0.002752957796F,    0.005063480600F,
       0.003770501663F,    0.004098458903F,    0.003054279305F,    0.003945040271F,
       0.003859853859F,    0.004078460368F,    0.004475165477F,    0.004915879889F,
       0.004545440732F,    0.004596551530F,    0.004591297802F,    0.007566212712F,
       0.006410290723F,    0.005888272917F,    0.008847361190F,    0.007857840794F,
      -0.398290598291F,    0.010825657037F,    0.009729460528F,    0.010279092297F,
       0.013771269119F,    0.013755738177F,    0.014925070565F,    0.018529903986F,
       0.021330298822F,    0.026577294329F,    0.035882196503F,    0.054037447268F,
       0.119987393090F,   -0.472401813770F,   -0.077274980811F,   -0.041706599650F,
      -0.027605635425F,   -0.020718781005F,   -0.016250851998F,   -0.012682920728F,
      -0.011316174086F,   -0.009523351103F,   -0.008557189961F,   -0.007080184600F,
      -0.006567136678F,   -0.004352133080F,   -0.004423370376F,   -0.003505538055F,
      -0.005891727254F,   -0.003589046037F,   -0.002648405056F,   -0.005700183782F,
      -0.002471628900F,   -0.002446138797F,    0.001461466412F,   -0.000687222526F,
      -0.000374895081F,    0.001651712038F,    0.000235394993F,    0.000695220222F,
       0.002123099098F,    0.002080522599F,    0.002409210842F,    0.002895290671F,
       0.004518551031F,    0.006393652537F,    0.003854093707F,    0.012586922984F,
       0.027710614581F,   -0.456925197626F,   -0.025586396953F,   -0.013417606010F,
      -0.009767993540F,   -0.006551898457F,   -0.004946592250F,   -0.002951747697F,
      -0.003552318427F,   -0.002803458798F,   -0.001950938862F,   -0.001602304420F,
      -0.001523986187F,   -0.000515627591F,   -0.000563259408F,   -0.000080088160F,
       2.873748473748F,    0.000097204644F,    0.000597907994F,    0.000832725778F,
       0.001544652475F,    0.001628977469F,    0.001951327847F,    0.002803518745F,
       0.003574555310F,    0.003230478803F,    0.004988917499F,    0.006584872340F,
       0.009874579626F,    0.013615126118F,    0.026005154441F,    0.464863302542F,
       0.028322897744F,    0.012896463384F,    0.004763349667F,    0.006512692272F,
       0.004677365941F,    0.002895319094F,    0.002472587679F,    0.002118273720F,
       0.002351520476F,    0.000803995125F,    0.000235432013F,    0.001722109881F,
       0.000411477193F,    0.000688140488F,    0.001512614921F,    0.002656997796F,
       0.002759027396F,    0.006306207896F,    0.002743141668F,    0.003826750294F,
       0.005961729623F,    0.004161359401F,    0.004978715709F,    0.005322431850F,
       0.007452377699F,    0.008178406959F,    0.009574892804F,    0.010973257361F,
       0.013256611233F,    0.015564508345F,    0.019250322915F,    0.024610943617F,
       0.033394116918F,    0.050518220103F,    0.094605856812F,    0.582876876676F,
       0.149710271430F,    0.068184043238F,    0.046634864530F,    0.033536970531F,
       0.027478441261F,    0.023718100317F,    0.019782742366F,    0.018238821012F,
       0.019089098536F,    0.013993003016F,    0.013292840147F,    0.014136690735F,
       0.398372114800F,    0.011372567571F,    0.012458439992F,    0.008943618599F,
       0.009500725433F,    0.011682743133F,    0.007481879978F,    0.007616198681F,
       0.008522406715F,    0.007002808962F,    0.007049551434F,    0.006222939896F,
       0.006678750830F,    0.006570240955F,    0.006090554943F,    0.006976956813F,
       0.006502405913F,    0.007730848656F,    0.005217180497F,    0.005558526593F,
       0.004639447452F,    0.005664393079F,    0.005457081251F,    0.004963916992F,
       0.006093178710F,    0.005484929154F,    0.005618841525F,    0.005441003978F,
       0.005653740081F,    0.006248850704F,    0.004010107956F,    0.004574913377F,
       0.004861672314F,    0.004860539389F,    0.004447036707F,    0.004156730402F,
       0.005175303180F,    0.005118983998F,    0.005019580245F,    0.004377943372F,
       0.004692819200F,    0.005659358961F,    0.003977652340F,    0.004083196295F,
       0.004140238783F,    0.004554488832F,    0.004832935164F,    0.005546628883F,
       0.002793227831F,    0.003555689199F,    0.003649941117F,    0.004563648552F,
       0.003955469250F,    0.003621492415F,    0.004843994882F,    0.004879446009F,
       0.005537242750F,    0.002682894319F,    0.003423180181F,    0.003629817622F,
       0.004430884128F,    0.003881990767F,    0.003605469283F,    0.004330024329F,
       0.004395604396F,    0.000000000000F,   -0.968281274915F,   -1.912902170664F,
      -0.667729283449F,   -1.407033155815F,   -1.389583816790F,   -1.590763813692F,
      -1.564256760390F,   -1.459195776087F,   -1.152342532598F,   -1.440443900682F,
      -1.470679343158F,   -1.423735375923F,   -1.400252397983F,   -1.391095083226F,
      -1.385728580546F,    1.779105221038F,    1.790334911996F,    2.198949515591F,
       1.762285590998F,    1.832130686785F,    1.575227332241F,    1.797697355837F,
       1.759872145591F,    2.015211480683F,    2.097025896621F,    1.588530399093F,
       1.283880230449F,   -1.145934393801F,   -1.519138385008F,    1.831591018212F,
      -1.169716954625F,   -1.110303057367F,   -1.128801973919F,   -1.307219220073F,
      -1.216478882187F,   -1.417401362726F,   -1.001725712243F,   -1.093970255718F,
      -0.957397737677F,   -1.078423396474F,   -1.046580746045F,   -1.105550505767F,
      -1.050896823777F,   -1.022905281159F,   -0.952490453792F,   -1.005044725613F,
      -1.000706246610F,   -0.973148804965F,   -0.971221121635F,   -0.955859151433F,
      -0.944946965320F,    2.211853449913F,    2.226656973981F,    2.263646636237F,
       2.226732186981F,    2.252888016499F,    2.244917504739F,    2.286778391164F,
       2.287156085374F,    2.335741089144F,    2.316533361379F,    2.320438970228F,
       2.269332506943F,   -1.591026552420F,    2.378794507249F,    2.351881410810F,
       2.422932182709F,    2.401012907823F,    2.437109533534F,    2.480910463590F,
       2.493680409281F,    2.579034610198F,    2.363409185869F,    2.453822765374F,
       2.426892133893F,    2.525402121962F,    2.497540519238F,    2.616286389438F,
       2.513715796808F,    2.523032684595F,    2.427448595042F,    2.585735543647F,
       2.602715767747F,    2.520520959485F,    2.696007601755F,    2.636139796259F,
       2.718074868817F,    2.693168754549F,    2.728898605931F,    2.800104209832F,
       2.556646549560F,    2.672026061358F,    2.689850449253F,    2.761443675906F,
       2.709374450687F,    2.841839687116F,    2.693639374110F,    2.723646076908F,
       2.535930101651F,    2.819594454210F,    2.817944200332F,    2.754056654232F,
       2.985433699151F,    2.876676535702F,    2.945635552495F,    2.892837221748F,
       2.956691856478F,    2.985755438662F,    2.776531327343F,    2.901785635087F,
       2.958559186424F,    2.969366182824F,    2.912262189826F,    3.052605478420F,
       2.885163185576F,    2.937168022356F,    2.741194752755F,    3.058820466278F,
       3.033629856705F,    2.993458186342F,   -2.915328172795F,    3.126018943379F,
      -3.064517109099F,    3.066975397711F,   -3.120888455319F,   -3.136302794799F,
       3.036697817257F,    3.141592653590F, };

uint16_t pass = 0U, fail = 0U;
float tolerance = 1.0e-3;
volatile uint16_t flagInputReady = 0;
volatile uint16_t sampleIndex = 0;
uint32_t max_idx = 1;

uint16_t test_input[2U*myRFFT0_RFFT_SIZE];
float32_t test_output[myRFFT0_RFFT_SIZE];
float32_t test_error[myRFFT0_RFFT_SIZE];
float32_t test_magnitude_phase[(myRFFT0_RFFT_SIZE >> 1) + 1];
float32_t twiddleFactors[myRFFT0_RFFT_SIZE];

uint16_t *inADC;
float32_t *inPtr = (float32_t *)test_input;
float32_t *outPtr = test_output;
float32_t *magPtr = test_magnitude_phase;
float32_t *phasPtr = test_magnitude_phase;

#ifdef __cplusplus
#pragma DATA_SECTION("FFT_buffer_1")
#else
#pragma DATA_SECTION(test_input, "FFT_buffer_1")
#endif

#ifdef __cplusplus
#pragma DATA_SECTION("FFT_buffer_2")
#else
#pragma DATA_SECTION(test_output, "FFT_buffer_2")
#endif

//
// Main
//
void main(void)
{
    //
    // Initialize CPU and peripherals
    //
    Device_init();
    Device_initGPIO();
    Interrupt_initModule();
    Interrupt_initVectorTable();
    Board_init();
    C2000Ware_libraries_init();

    int16_t i, j;
    float32u_t out, gold, err;
    float32_t max;
    float32_t *p_temp;

    RFFT_adc_f32(myRFFT0_adc_handle);

    p_temp      = test_output;
    for(i = 0U; i < myRFFT0_RFFT_SIZE; i++)
    {
        out.f32     = p_temp[i];
        gold.f32    = test_golden[i];
        err.f32     = fabsf(out.f32 - gold.f32);
        if(err.f32 < tolerance)
        {
            pass++;
        }
        else
        {
            fail++;
        }
        test_error[i] = err.f32;
    }

    flagInputReady = 0;

    RFFT_f32_mag_TMU0(myRFFT0_handle);
    p_temp      = test_magnitude_phase;

    max = 0.0f;
    max_idx = 1;

    for(i = 1U; i < myRFFT0_RFFT_SIZE / 2; i++)
    {
        if(p_temp[i] > max)
        {
            max = p_temp[i];
            max_idx = i;
        }
    }

    if (max_idx == 51)
    {
        pass = 1;
        fail = 0;
    }
    else
    {
        pass = 0;
        fail = 1;
    }

    for(i = (myRFFT0_RFFT_SIZE), j=0U; i <= (myRFFT0_RFFT_SIZE+(myRFFT0_RFFT_SIZE >> 1)); i++, j++)
    {
        out.f32     = p_temp[j];
        gold.f32    = test_golden[i];
        err.f32     = fabsf(out.f32 - gold.f32);
        if(err.f32 < tolerance)
        {
            pass++;
        }
        else
        {
            fail++;
        }
        test_error[j] = err.f32;
    }

    RFFT_f32_phase_TMU0(myRFFT0_handle);
    p_temp      = test_magnitude_phase;

    for(i  = (myRFFT0_RFFT_SIZE+(myRFFT0_RFFT_SIZE >> 1)+1U), j=0U;
            i <= ((myRFFT0_RFFT_SIZE << 1)+1U); i++, j++)
    {
        out.f32     = p_temp[j];
        gold.f32    = test_golden[i];
        err.f32     = fabsf(out.f32 - gold.f32);
        if(err.f32 < tolerance)
        {
            pass++;
        }
        else
        {
            fail++;
        }
        test_error[j] = err.f32;
    }
    while(1);
}

//
// End of File
//
